KanatERPSukhova.КанатАдаптация/src/DataProcessors/МобильноеРабочееМестоКладовщика/МобильноеРабочееМестоКладовщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fdfd35a6-1406-4103-890b-56e84434ce5a">
  <name>МобильноеРабочееМестоКладовщика</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="51b836e4-2654-4a0f-841d-e940e4523122">
    <name>КАНАТ_Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/МобильноеРабочееМестоКладовщика/ManagerModule.bsl
// <+БИТ> Руденков_Е.И. 25.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&ИзменениеИКонтроль("НайтиТоварПоШК")
Функция КАНАТ_НайтиТоварПоШК(ЗначениеШтрихкода)

	СтруктураТовара = Новый Структура;
	СтруктураТовара.Вставить("Номенклатура", "");
	СтруктураТовара.Вставить("Характеристика", "");
	СтруктураТовара.Вставить("Упаковка", "");
	СтруктураТовара.Вставить("Количество", 1);
	#Вставка
	СтруктураТовара.Вставить("Серия","");
	#КонецВставки

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	#Вставка
	|	ШтрихкодыНоменклатуры.КАНАТ_Серия КАК Серия,
	#КонецВставки
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";

	Запрос.УстановитьПараметр("Штрихкод", ЗначениеШтрихкода);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураТовара, ВыборкаДетальныеЗаписи);
	КонецЦикла;

	Возврат СтруктураТовара;

КонецФункции

// Возвращает статус указания серии
//
// Параметры:
//  Серия  - справочник СерииНоменклатуры - серия номенклатуры
//
// Возвращаемое значение:
//   Число   - число соответсвующее статусу. 6 - серия со сроком годности. 8 - серия без срока годности.
//
Функция ПолучитьСтатусУказанияСерий(Серия)Экспорт
	
	СтатусУказанияСерий = 7;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Серия) Тогда	
		СрокГодности = Серия.ГоденДо;
		Если ЗначениеЗаполнено(СрокГодности) Тогда
			 СтатусУказанияСерий = 6;
		Иначе
			СтатусУказанияСерий = 8;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтатусУказанияСерий;

КонецФункции

// <-БИТ> Руденков_Е.И. 25.07.2024
